[
    {
        "ETid": "ETid-2534",
        "Country": "SPAIN",
        "Authority": "Spanish Data Protection Authority (aepd)",
        "Date of Decision": "2024-12-16",
        "Fine [€]": "70,000",
        "Controller/Processor": "INTERURBANA DE AUTOBUSES, S.A.",
        "Sector": "Employment",
        "Quoted Art.": "Art. 5 (1) c) GDPR",
        "Type": "Non-compliance with general data processing principles",
        "Summary": "The Spanish DPA has fined INTERURBANA DE AUTOBUSES, S.A. EUR 70,000 after an employee filed a complaint over the publication of personal data on the company's bulletin boards. According to the data controller, an error in the HR department led to printing a full list of the employees—including sensitive details like addresses—instead of the electoral roll, which is meant to include only the information necessary for union elections. The DPA considered this to be a violation of the principle of data minimization, since, on the one hand, more personal data than necessary for the election was published and, by posting it on the bulletin boards, there was a risk that third parties could see the data from the outside through a window.",
        "Source": "link",
        "Direct URL": "https://www.enforcementtracker.com/ETid-2534 (Copy: ) | Short URL: https://etid.link/ETid-2534"
    },
    {
        "ETid": "ETid-2533",
        "Country": "SPAIN",
        "Authority": "Spanish Data Protection Authority (aepd)",
        "Date of Decision": "2024-12-23",
        "Fine [€]": "15,000",
        "Controller/Processor": "HSSERVICE LIZCON SOLUTIONS, S.L.",
        "Sector": "Industry and Commerce",
        "Quoted Art.": "Art. 58 (2) GDPR",
        "Type": "Insufficient cooperation with supervisory authority",
        "Summary": "The Spanish DPA has imposed a fine of EUR 15,000 on HSSERVICE LIZCON SOLUTIONS, S.L. for failing to prove compliance with an order issued by the DPA",
        "Source": "link",
        "Direct URL": "https://www.enforcementtracker.com/ETid-2533 (Copy: ) | Short URL: https://etid.link/ETid-2533"
    },
    {
        "ETid": "ETid-2532",
        "Country": "SPAIN",
        "Authority": "Spanish Data Protection Authority (aepd)",
        "Date of Decision": "2023-12-27",
        "Fine [€]": "6,500,000",
        "Controller/Processor": "THE PHONE HOUSE SPAIN, S.L.",
        "Sector": "Media, Telecoms and Broadcasting",
        "Quoted Art.": "Art. 5 (1) f) GDPR, Art. 32 GDPR",
        "Type": "Insufficient technical and organisational measures to ensure information security",
        "Summary": "The Spanish DPA has imposed a fine of EUR 6.5 million on THE PHONE HOUSE SPAIN, S.L. The controller had suffered a ransomware attack affecting personal data of 13 million individuals (e.g. customers and employees), which was exfiltrated and published on the deep web. The DPA's investigation revealed that the controller had failed to implement appropriate technical and organisational measures to protect personal data, in order to prevent such an incident.",
        "Source": "link",
        "Direct URL": "https://www.enforcementtracker.com/ETid-2532 (Copy: ) | Short URL: https://etid.link/ETid-2532"
    },
    {
        "ETid": "ETid-2531",
        "Country": "ITALY",
        "Authority": "Italian Data Protection Authority (Garante)",
        "Date of Decision": "2024-11-13",
        "Fine [€]": "5,000,000",
        "Controller/Processor": "Foodinho Srl",
        "Sector": "Employment",
        "Quoted Art.": "Art. 5 (1) a), c), d), e) GDPR, Art. 6 GDPR, Art. 9 (2) b) GDPR, Art. 12 GDPR, Art. 13 GDPR, Art. 22 (3) GDPR, Art. 25 GDPR, Art. 28 GDPR, Art. 32 GDPR, Art. 35 GDPR, Art. 88 GDPR, Art. 2-septies Codice della privacy, Art. 114 Codice della privacy, Art. 47-quinquies Decreto legislativo 81/2015",
        "Type": "Non-compliance with general data processing principles",
        "Summary": "The Italian DPA has fined the food delivery service Foodinho Srl EUR 5 million for unlawfully processing the data of approximately 35,000 drivers and for several violations of the GDPR. The DPA's investigation revealed that the company collected drivers' location data without their knowledge or consent—not only during working hours but also when the app was running in the background or inactive. Additionally, the DPA found that the company shared driver data with third parties without a valid legal basis. The investigation also uncovered that automated data processing was used for functions such as the evaluation system and task allocation during shifts, but the company had failed to implement necessary GDPR measures, such as allowing human intervention or enabling drivers to contest decisions made through the automated systems. Furthermore, biometric data, including facial recognition, was used without a valid legal basis. The investigation also revealed that drivers whose accounts were blocked received only standardized messages, with no information provided about their rights to appeal.",
        "Source": "link link",
        "Direct URL": "https://www.enforcementtracker.com/ETid-2531 (Copy: ) | Short URL: https://etid.link/ETid-2531"
    },
    {
        "ETid": "ETid-2530",
        "Country": "SPAIN",
        "Authority": "Spanish Data Protection Authority (aepd)",
        "Date of Decision": "2024-11-22",
        "Fine [€]": "220,000",
        "Controller/Processor": "CARTONAJES BAÑERES, S.A.",
        "Sector": "Employment",
        "Quoted Art.": "Art. 15 GDPR, Art. 35 GDPR",
        "Type": "Insufficient technical and organisational measures to ensure information security",
        "Summary": "The Spanish DPA imposed a fine of EUR 220,000 on CARTONAJES BAÑERES, S.A. following a complaint filed by a former employee. The employee had submitted a request to the controller for access to their personal data, particularly inquiring about the purpose and categories of data held. However, they did not receive a proper response. The employee also stated that the controller used a biometric facial recognition system that allowed employees to clock in and out, but did not offer an alternative method of recording attendance. During its investigation, the DPA found that the controller had failed to properly comply with the data subject's request for access to their personal data. Furthermore, the DPA found that the controller had failed to carry out a risk assessment of the biometric system, which would have been necessary considering the risks that the processing of biometric data poses to data subjects.",
        "Source": "link",
        "Direct URL": "https://www.enforcementtracker.com/ETid-2530 (Copy: ) | Short URL: https://etid.link/ETid-2530"
    },
    {
        "ETid": "ETid-2529",
        "Country": "SPAIN",
        "Authority": "Spanish Data Protection Authority (aepd)",
        "Date of Decision": "2024-11-11",
        "Fine [€]": "200,000",
        "Controller/Processor": "Correo Inteligente Postal, S.L.",
        "Sector": "Transportation and Energy",
        "Quoted Art.": "Art. 5 (1) f) GDPR, Art. 32 GDPR",
        "Type": "Insufficient technical and organisational measures to ensure information security",
        "Summary": "The Spanish DPA fined Correo Inteligente Postal, S.L. EUR 200,000 after several incidents of undelivered letters containing personal data were reported. These letters, which contained personal data, were found disposed of in unauthorized locations and should have been delivered to the recipients by the responsible employees. During its investigation, the DPA found that the controller had failed to implement appropriate technical and organizational measures to protect personal data in order to prevent such incidents. The DPA also ordered the controller to implement a system to verify the traceability of the letters sent and provide employees with specific instructions on how to properly deliver the letters.",
        "Source": "link",
        "Direct URL": "https://www.enforcementtracker.com/ETid-2529 (Copy: ) | Short URL: https://etid.link/ETid-2529"
    },
    {
        "ETid": "ETid-2528",
        "Country": "SPAIN",
        "Authority": "Spanish Data Protection Authority (aepd)",
        "Date of Decision": "2024-12-23",
        "Fine [€]": "300,000",
        "Controller/Processor": "LÍNEA DIRECTA ASEGURADORA, S.A.",
        "Sector": "Finance, Insurance and Consulting",
        "Quoted Art.": "Art. 6 (1) GDPR, Art. 28 GDPR",
        "Type": "Insufficient legal basis for data processing",
        "Summary": "The Spanish DPA has imposed a fine of EUR 300,000 on LÍNEA DIRECTA ASEGURADORA, S.A.. A data subject had filed a complaint with the DPA stating that they had inquired about a car insurance quote with Línea Directa and were subsequently contacted by one of Línea Directa's processors. Without their consent, the processor had accessed their driving license points via the website of a traffic authority.",
        "Source": "link",
        "Direct URL": "https://www.enforcementtracker.com/ETid-2528 (Copy: ) | Short URL: https://etid.link/ETid-2528"
    },
    {
        "ETid": "ETid-2527",
        "Country": "SPAIN",
        "Authority": "Spanish Data Protection Authority (aepd)",
        "Date of Decision": "2024-12-18",
        "Fine [€]": "100,000",
        "Controller/Processor": "ATRIUM LEX SFC",
        "Sector": "Real Estate",
        "Quoted Art.": "Art. 13 GDPR, Art. 32 (1) GDPR",
        "Type": "Insufficient fulfilment of information obligations",
        "Summary": "The Spanish DPA has imposed a fine of EUR 100,000 on the real estate management company ATRIUM LEX SFC. An investor had filed a complaint with the DPA because the controller had requested a copy of the investor's ID card to enable them to receive information about a project. The DPA found that the controller had not provided sufficient information about this data processing and that the sending of copies of ID cards by email was not sufficiently secure. The DPA assessed this as a violation of Art. 13 GDPR and Art. 32 (1) GDPR.",
        "Source": "link",
        "Direct URL": "https://www.enforcementtracker.com/ETid-2527 (Copy: ) | Short URL: https://etid.link/ETid-2527"
    },
    {
        "ETid": "ETid-2526",
        "Country": "ITALY",
        "Authority": "Italian Data Protection Authority (Garante)",
        "Date of Decision": "2024-09-12",
        "Fine [€]": "842,062",
        "Controller/Processor": "Sky Italia S.r.l.",
        "Sector": "Media, Telecoms and Broadcasting",
        "Quoted Art.": "Art. 5 (1) a) GDPR, Art. 6 (1) a) GDPR, Art. 130 Codice della privacy",
        "Type": "Insufficient legal basis for data processing",
        "Summary": "The Italian DPA has fined Sky Italia EUR 842,062 for unlawful telemarketing. The investigation revealed that Sky contacted individuals without proper consent, including those registered in advertising opt-out lists and those who had given consent before the GDPR came into force—without reassesing its validity under the updated legal framework. Additionally, the documentation of consents obtained from data providers was deemed inadequate, as Sky stored consent details in modifiable Excel files, failing to ensure clear and verifiable proof of user consent.",
        "Source": "link",
        "Direct URL": "https://www.enforcementtracker.com/ETid-2526 (Copy: ) | Short URL: https://etid.link/ETid-2526"
    },
    {
        "ETid": "ETid-2525",
        "Country": "ITALY",
        "Authority": "Italian Data Protection Authority (Garante)",
        "Date of Decision": "2024-12-14",
        "Fine [€]": "2,000",
        "Controller/Processor": "Torre Annunziata municipality",
        "Sector": "Public Sector and Education",
        "Quoted Art.": "Art. 37 (7) GDPR",
        "Type": "Insufficient involvement of data protection officer",
        "Summary": "The Italian DPA has imposed a fine of EUR 2,000 on Torre Annunziata municipality for failing to provide the DPA with the contact details of their data protection officer in good time.",
        "Source": "link",
        "Direct URL": "https://www.enforcementtracker.com/ETid-2525 (Copy: ) | Short URL: https://etid.link/ETid-2525"
    }
]